"""
Версия 1.0
"""
# List of the territories
territories = ["Российская Федерация", "Россия",
               "Северо-Кавказский федеральный округ",
               "Ставропольский край",
               "Республика Ингушетия",
               "Республика Дагестан",
               "Кабардино-Балкарская Республика",
               "Республика Северная Осетия - Алания",
               "Карачаево-Черкесская Республика",
               "Чеченская республика",
               "Южный федеральный округ",
               "Краснодарский край",
               "Астраханская область",
               "Волгоградская область",
               "Ростовская область",
               "Республика Адыгея", "Адыгея",
               "Республика Калмыкия",
               "Приволжский федеральный округ",
               "Нижегородская область",
               "Кировская область",
               "Самарская область",
               "Оренбургская область",
               "Пензенская область",
               "Пермский край",
               "Саратовская область",
               "Ульяновская область",
               "Республика Башкортостан",
               "Республика Марий Эл",
               "Республика Мордовия",
               "Республика Татарстан",
               "Татарстан",
               "Удмуртская республика",
               "Чувашская Республика",
               "Чувашия",
               "Северо-Западный федеральный округ",
               "Архангельская область",
               "Ненецкий автономный округ",
               "Вологодская область",
               "Калининградская область",
               "Санкт-Петербург",
               "Ленинградская область",
               "Мурманская область",
               "Новгородская область",
               "Псковская область",
               "Республика Карелия",
               "Республика Коми",
               "Сибирский федеральный округ",
               "Алтайский край",
               "Красноярский край",
               "Кемеровская область",
               "Иркутская область",
               "Новосибирская область",
               "Омская область",
               "Томская область",
               "Забайкальский край",
               "Республика Бурятия",
               "Республика Алтай",
               "Республика Тыва",
               "Республика Хакасия",
               "Уральский федеральный округ",
               "Курганская область",
               "Свердловская область",
               "Тюменская область",
               "Ханты-Мансийский автономный округ - Югра",
               "Ямало-Ненецкий автономный округ",
               "Челябинская область",
               "Центральный федеральный округ",
               "Белгородская область",
               "Брянская область",
               "Владимирская область",
               "Воронежская область",
               "Ивановская область",
               "Тверская область",
               "Калужская область",
               "Костромская область",
               "Курская область",
               "Липецкая область",
               "Москва",
               "Московская область",
               "Орловская область",
               "Рязанская область",
               "Смоленская область",
               "Тамбовская область",
               "Тульская область",
               "Ярославская область",
               "Дальневосточный федеральный округ",
               "Приморский край",
               "Хабаровский край",
               "Амурская область",
               "Камчатский край",
               "Магаданская область",
               "Сахалинская область",
               "Чукотский автономный округ",
               "Республика Саха", "Якутия",
               "Еврейская автономная область",
               "Крымский федеральный округ",
               "Республика Крым",
               "Севастополь",
               "Байконур"]

# the Levenstein distance algorithm
def distance(a, b):
    """Calculates the Levenshtein distance between a and b."""
    n, m = len(a), len(b)
    if n > m:
        # Make sure n <= m, to use O(min(n,m)) space
        a, b = b, a
        n, m = m, n

    current_row = range(n + 1)  # Keep current and previous row, not entire matrix
    for i in range(1, m + 1):
        previous_row, current_row = current_row, [i] + [0] * n
        for j in range(1, n + 1):
            add, delete, change = previous_row[j] + 1, current_row[j - 1] + 1, previous_row[j - 1]
            if a[j - 1] != b[i - 1]:
                change += 1
            current_row[j] = min(add, delete, change)

    return current_row[n]

# 
def check_the_territories(str_user):
    minimum_value = 123
    index_of_the_most_likely_variant = 0
    i = 0
    for _ in territories:
        if distance(str_user, territories[i]) < minimum_value:
            minimum_value = distance(str_user, territories[i])
            index_of_the_most_likely_variant = i
        i += 1
    if minimum_value == 0:
        print('В бд запишем '+str_user)
    else:
        print('Наверное, вы имели в виду ' + territories[index_of_the_most_likely_variant] + '?')

check_the_territories(input())
